Tekla.Structures.TeklaStructuresInternal.EventHandler.AddListener(Tekla.Structures.TeklaStructuresInternal.IEvents)
EventListener:

Tekla.Structures.TeklaStructuresInternal.EventHandler.RemoveListener(Tekla.Structures.TeklaStructuresInternal.IEvents)
EventListener: